#Задание 1
#Загрузите модуль pyplot библиотеки matplotlib с псевдонимом plt, а также библиотеку numpy с псевдонимом np.
#Примените магическую функцию %matplotlib inline для отображения графиков в Jupyter Notebook и настройки конфигурации
#ноутбука со значением 'svg' для более четкого отображения графиков.
#Создайте список под названием x с числами 1, 2, 3, 4, 5, 6, 7 и список y с числами 3.5, 3.8, 4.2, 4.5, 5, 5.5, 7.
#С помощью функции plot постройте график, соединяющий линиями точки с горизонтальными координатами из списка x и
#вертикальными - из списка y.
#Затем в следующей ячейке постройте диаграмму рассеяния (другие названия - диаграмма разброса, scatter plot).


#Решение протестировано в JupiterNotebook и приложен html-файл, созданный на основе результатов работы в данном сервисе,
#но как итоговая среда выбран PyCharm

import numpy as np
from matplotlib import pyplot as plt
#%matplotlib inline
#%config InlineBackend.figure_format = 'svg'

x = [1, 2, 3, 4, 5, 6, 7]
y = [3.5, 3.8, 4.2, 4.5, 5, 5.5, 7]
plt.plot(x, y)
plt.show()
